from collections import UserDict


class AddressBook(UserDict):
    """
    Клас AddressBook, який успадковується від UserDict,
    та ми потім додамо логіку пошуку за записами до цього класу.

    * AddressBook реалізує метод add_record, який додає Record у self.data."""
    pass


class Record:
    """Клас Record, який відповідає за логіку додавання/видалення/редагування
    необов'язкових полів та зберігання обов'язкового поля Name.

    * Записи Record у AddressBook зберігаються як значення у словнику.
    В якості ключів використовується значення Record.name.value.
    * Record зберігає об'єкт Name в окремому атрибуті.
    * Record зберігає список об'єктів Phone в окремому атрибуті.
    * Record реалізує методи для додавання/видалення/редагування об'єктів Phone."""
    pass


class Field:
    """Клас Field, який буде батьківським для всіх полів,
    у ньому потім реалізуємо логіку загальну для всіх полів"""
    pass


class Name:
    """Клас Name, обов'язкове поле з ім'ям."""
    pass


class Phone:
    """Клас Phone, необов'язкове поле з телефоном
    та таких один запис (Record) може містити кілька."""
    pass


if __name__ == '__main__':
    pass
